Repository: RadiSaiyed/syriasuperapp
Catalog: clients/taxi_flutter/lib/l10n/app_*.arb
Languages: ar

# appTitleRider
source: Taxi Rider
ar: راكب تاكسي

# navRider
source: Rider
ar: راكب

source: Open Payments
ar: فتح المدفوعات

source: Set Base URL
ar: تعيين عنوان الخادم

source: Save
ar: حفظ

source: Cancel
ar: إلغاء

source: Tap sets:
ar: النقر يحدد:

source: Pickup
ar: الانطلاق

source: Dropoff
ar: الوصول

source: Quote
ar: تسعير

source: Request Ride
ar: طلب رحلة

source: My rides
ar: رحلاتي

source: Last ride:
ar: آخر رحلة:

source: Status:
ar: الحالة:

source: Apply (dev)
ar: تفعيل (تجريبي)

source: Set loc
ar: تعيين الموقع

source: Profile / Earnings
ar: الملف / الأرباح

source: Top up
ar: شحن الرصيد

# fareQuoted
source: Fare (quoted): {amount}
ar: الأجرة (تقديري): {amount}

# fareFinal
source: Fare (final): {amount}
ar: الأجرة (نهائي): {amount}

source: Ride canceled
ar: تم إلغاء الرحلة

# paymentsNotAvailable
source: Payments app not available
ar: تطبيق المدفوعات غير متوفر

source: Actions
ar: إجراءات

source: Ride completed
ar: تم إنهاء الرحلة

# cashPlease
source: Please pay cash. Thank you!
ar: يرجى الدفع نقداً. شكراً!

# priceOfRide
source: Price of ride: {amount} (cash)
ar: سعر الرحلة: {amount} (نقداً)

# bookPayApp
source: Book & pay in app
ar: احجز وادفع عبر التطبيق

source: Book & pay cash
ar: احجز وادفع نقداً

# riderRewardApplied
source: Loyalty reward: this ride was free!
ar: مكافأة الولاء: هذه الرحلة مجانية!

# driverRewardApplied
source: Driver reward: platform fee waived.
ar: مكافأة السائق: تم إعفاء عمولة المنصة.

# walletTitle
source: Wallet
ar: المحفظة

# walletBalanceLabel
source: Balance
ar: الرصيد

source: Refresh
ar: تحديث

source: Choose Taxi Class
ar: اختر فئة التاكسي

# rideClassStandard
source: Standard
ar: عادي

# rideClassComfort
source: Comfort
ar: مريح

# rideClassYellow
source: Yellow
ar: الأصفر

# rideClassVAN
source: VAN
ar: فان

# rideClassElectro
source: Electro
ar: كهربائي

# eta
source: ETA ~ {mins} min
ar: الوصول ~ {mins} دقيقة

# rateFive
source: Rate 5â˜…
ar: تقييم 5★

source: Cancel ride
ar: إلغاء الرحلة

source: Schedule (15m)
ar: جدولة (15د)

source: Dispatch (dev)
ar: تشغيل (تجريبي)

# optionalStopPromo
source: Optional Stop and Promo
ar: توقف اختياري ورمز ترويجي

source: Stop lat (optional)
ar: إحداثي توقف (اختياري)

source: Stop lon (optional)
ar: إحداثي توقف (اختياري)

source: Promo code (optional)
ar: رمز ترويجي (اختياري)

source: Favorites
ar: المفضلة

source: Save current pickup
ar: حفظ نقطة الانطلاق الحالية

source: Set pickup
ar: تعيين الانطلاق

source: Set drop
ar: تعيين الوصول

# continueLabel
source: Continue
ar: متابعة

# scheduledAt
source: Scheduled at {ts}
ar: تمت الجدولة عند {ts}

# dispatchRequested
source: Dispatch requested (dev)
ar: تم طلب التنفيذ (تجريبي)

source: Search address
ar: ابحث عن عنوان

source: Type an address
ar: اكتب عنوانًا

# mapSectionTitle
source: Map
ar: الخريطة

# tripPlannerSectionTitle
source: Trip planner
ar: مخطط الرحلة

# rideOptionsSectionTitle
source: Ride options
ar: خيارات الرحلة

# quoteSummarySectionTitle
source: Quote summary
ar: ملخص التسعير

# scheduledRidesSectionTitle
source: Scheduled rides
ar: الرحلات المجدولة

# developerToolsSectionTitle
source: Developer tools
ar: أدوات المطوّر

source: Show driver location
ar: إظهار موقع السائق

source: Hide driver location
ar: إخفاء موقع السائق

source: Fullscreen map
ar: خريطة بملء الشاشة

# quotePriceLabel
source: Price
ar: السعر

# quoteSurgeLabel
source: Surge
ar: عامل الزيادة

# quoteDistanceLabel
source: Distance
ar: المسافة

# quoteEtaLabel
source: ETA
ar: المدة المتوقعة

# pickScheduleDateTime
source: Pick date & time
ar: اختر التاريخ والوقت

# scheduleRideCta
source: Schedule ride
ar: جدولة الرحلة

# scheduledEmpty
source: No scheduled rides
ar: لا توجد رحلات مجدولة

# testingShortcutsTitle
source: Testing shortcuts
ar: اختصارات الاختبار

source: Dispatch pending
ar: إطلاق الرحلات المعلّقة

source: Close
ar: إغلاق
